app/Http/Controllers/AdminController.php

    public function transactionManager()
    {
        $transactions = Bill::with(['users', 'managers'])->get();
        $sellers_long = Manager::where('role', 0)->orderBy('created_at', 'desc')->take(5)->get();
        $sellers_best = Bill::with('managers')->whereNotNull('seller_id')->groupBy('seller_id') ->select( DB ::raw('seller_id , COUNT(*) as seller_count') )->limit(5)->get();
---
select * from `bills`
select * from `managers` where `managers`.`id` in (2, 3)
select * from `users` where `users`.`id` in (1, 2, 3)
select * from `managers` where `role` = 0 order by `created_at` desc limit 5
select seller_id , COUNT(*) as seller_count from `bills` where `seller_id` is not null group by `seller_id` limit 5