app/Http/Controllers/ManagerController.php

    public function billDetail($id)
    {
        // $list = 0;
        //$list = DB::select('SELECT products.name_pro, products.price_license, bill__products.amount_licenses FROM bill__products JOIN products ON bill__products.pro_id = products.id JOIN bills ON bill__products.bill_id = bills.id WHERE bills.id = 1');

        $list = Bill_Product::with(['products:id,name_pro,price_license'])->where('bill_id', $id)->get();
---
select * from `bill__products` where `bill_id` = '1'
select `id`, `name_pro`, `price_license` from `products` where `products`.`id` in (1, 2)