app/Http/Controllers/ProductController.php

    public function index()
    {
        $products = Product::all();
---
select * from `products`