app/Http/Controllers/TransactionController.php

select * from `bills`
select * from `managers` where `managers`.`id` in (2, 3)
select * from `users` where `users`.`id` in (1, 2, 3)
select * from `managers` where `role` = 0 order by `created_at` desc limit 5
select seller_id , COUNT(*) as seller_count from `bills` where `seller_id` is not null group by `seller_id` limit 5
---
    public function index()
    {
        $trans = Bill::with(['users', 'managers'])->get();
        $sellers_long = Manager::where('role', 0)->orderBy('created_at', 'desc')->take(5)->get();
        $sellers_best = Bill::with('managers')->whereNotNull('seller_id')->groupBy('seller_id') ->select( DB::raw('seller_id , COUNT(*) as seller_count') )->limit(5)->get();

update `bills` set `seller_id` = 2, `bills`.`updated_at` = '2020-08-10 10:24:20' where `id` = 5
---
    public function update(Request $request, $id)
    {
        $bill = Bill::find($id);
        $bill->seller_id = $request->seller;
        $bill->save();